In [8]:
import pandas as pd
print(pd.__version__)

1.4.2

In [9]:
#pandas is an python library used to analyze data
#here we are working with datasets ,analyzing,manipulating and exploring datasets
#with pandas we can work with large data
#why we use?
#to say corelation between two columns,min ,max values from columns

In [10]:
#series-1-D arrays
a=[1,0,4,8,3]
s=pd.Series(a)
print(s)

0    1
1    0
2    4
3    8
4    3
dtype: int64

In [11]:
#we can also specify indexes using index function
s=pd.Series(a,index=['a','b','c','d','e'])
print(s)

a    1
b    0
c    4
d    8
e    3
dtype: int64

In [14]:
print(s['a'])
print(s['b'])

1
0

In [20]:
dict={"a":1,"e":0,"f":2,"g":3}
s=pd.Series(dict)
print(s)
print(s['f'])
print(s['g'])

a    1
e    0
f    2
g    3
dtype: int64
2
3

In [9]:
#Dataframe's are like multidimensional arrays 
import pandas as pd
data_set={"name":["bhanu","lavanya","potti"],"age":[12,16,10]}
df=pd.DataFrame(data_set)
print(df)

      name  age
0    bhanu   12
1  lavanya   16
2    potti   10

In [10]:
#loc can be used to display row based on index
df.loc[1]

name    lavanya
age          16
Name: 1, dtype: object

In [17]:
print(df.loc[0:2])

      name  age
0    bhanu   12
1  lavanya   16
2    potti   10

In [14]:
print(df.loc[:2])

      name  age
0    bhanu   12
1  lavanya   16
2    potti   10

In [19]:
print(df.loc[[0,2]])

    name  age
0  bhanu   12
2  potti   10

In [20]:
df=pd.DataFrame(data_set,index=['a','b','c'])
print(df)

      name  age
a    bhanu   12
b  lavanya   16
c    potti   10

In [21]:
print(df.loc[['a','c']])

    name  age
a  bhanu   12
c  potti   10

In [22]:
df=pd.read_csv("sample1.csv")
print(df)

  name   age  marks gender   dept
0    a  16.0     98    NaN    cse
1    b   NaN     91      m    ece
2    c  10.0     90      f   mech
3  NaN  19.0     88      f  civil
4    f   NaN     98      m    eee
5    k  18.0     77      m   mech
6    y   9.0     80      m    cse
7    i   7.0     85      f    cse
8    l  17.0     72    NaN    eee
9    h  14.0     64      m    NaN

In [25]:
#if we have large dataset than pandas will display first and last five rows ,
#so if we use to_string function it can display all rows
print(df.to_string())

  name   age  marks gender   dept
0    a  16.0     98    NaN    cse
1    b   NaN     91      m    ece
2    c  10.0     90      f   mech
3  NaN  19.0     88      f  civil
4    f   NaN     98      m    eee
5    k  18.0     77      m   mech
6    y   9.0     80      m    cse
7    i   7.0     85      f    cse
8    l  17.0     72    NaN    eee
9    h  14.0     64      m    NaN

In [26]:
#head function can be used to display top five rows defaulty,you can also specify no of rows
#tail function can display last five rows defaultly
print(df.head(3))

  name   age  marks gender  dept
0    a  16.0     98    NaN   cse
1    b   NaN     91      m   ece
2    c  10.0     90      f  mech

In [27]:
print(df.tail(2))

  name   age  marks gender dept
8    l  17.0     72    NaN  eee
9    h  14.0     64      m  NaN

In [28]:
print(df.head())

  name   age  marks gender   dept
0    a  16.0     98    NaN    cse
1    b   NaN     91      m    ece
2    c  10.0     90      f   mech
3  NaN  19.0     88      f  civil
4    f   NaN     98      m    eee

In [29]:
print(df.tail())

  name   age  marks gender  dept
5    k  18.0     77      m  mech
6    y   9.0     80      m   cse
7    i   7.0     85      f   cse
8    l  17.0     72    NaN   eee
9    h  14.0     64      m   NaN

In [30]:
#this function will give information about dataset
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     8 non-null      float64
 2   marks   10 non-null     int64
 3   gender  8 non-null      object
 4   dept    9 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 528.0+ bytes
None

In [31]:
print(df)

  name   age  marks gender   dept
0    a  16.0     98    NaN    cse
1    b   NaN     91      m    ece
2    c  10.0     90      f   mech
3  NaN  19.0     88      f  civil
4    f   NaN     98      m    eee
5    k  18.0     77      m   mech
6    y   9.0     80      m    cse
7    i   7.0     85      f    cse
8    l  17.0     72    NaN    eee
9    h  14.0     64      m    NaN

In [32]:
print(df["name"])

0      a
1      b
2      c
3    NaN
4      f
5      k
6      y
7      i
8      l
9      h
Name: name, dtype: object

In [33]:
print(df[['name','dept']])

  name   dept
0    a    cse
1    b    ece
2    c   mech
3  NaN  civil
4    f    eee
5    k   mech
6    y    cse
7    i    cse
8    l    eee
9    h    NaN

In [35]:
print(df['age'].max())
print(df['age'].min())

19.0
7.0

In [36]:
print(df.loc[3,'name'])

nan

In [49]:
df["salary"]=0

In [50]:
df

  name   age  marks gender   dept  salary
0    a  16.0     98    NaN    cse       0
1    b   NaN     91      m    ece       0
2    c  10.0     90      f   mech       0
3  NaN  19.0     88      f  civil       0
4    f   NaN     98      m    eee       0
5    k  18.0     77      m   mech       0
6    y   9.0     80      m    cse       0
7    i   7.0     85      f    cse       0
8    l  17.0     72    NaN    eee       0
9    h  14.0     64      m    NaN       0

In [52]:
df.age>30 && df.name=

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: age, dtype: bool